---
kind: property
id: P:Autodesk.Revit.DB.ImageType.ExternalResourceType
source: html/87b4d0ea-c7bb-8063-b4d4-c81b9213ca55.htm
---
# Autodesk.Revit.DB.ImageType.ExternalResourceType Property

The type of external resources that represents images.

## Syntax (C#)
```csharp
public static ExternalResourceType ExternalResourceType { get; }
```